Revit 2024 API
MEPBuildingConstructionSet.Size Property
Returns the number of MEPBuildingConstructions that are in the set.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual int Size { get; }
Visual Basic
Public Overridable ReadOnly Property Size As Integer
	Get
Visual C++
public:
virtual property int Size {
	int get ();
}
See Also
MEPBuildingConstructionSet Class
Autodesk.Revit.DB.Mechanical Namespace